{
  "native_plants": {
    "Auckland": [
      {
        "name": "Pōhutukawa",
        "scientific_name": "Metrosideros excelsa",
        "description": "Known as the New Zealand Christmas tree, it is well-suited for coastal conditions and urban environments.",
        "benefits": "Drought-tolerant, minimal maintenance once established, and provides vibrant red flowers in summer.",
        "image_source": "/image/Pōhutukawa.png"
      },
      {
        "name": "Kōwhai",
        "scientific_name": "Sophora spp.",
        "description": "A small to medium-sized tree known for its striking yellow flowers.",
        "benefits": "Tolerates dry conditions, attracts native birds like tui and bellbird.",
        "image_source": "/image/Kōwhai.png"
      },
      {
        "name": "Harakeke",
        "scientific_name": "Phormium tenax",
        "description": "A robust, clump-forming flax with long, sword-like leaves.",
        "benefits": "Extremely hardy, tolerates poor soil, coastal conditions, and requires minimal care.",
        "image_source": "/image/Harakeke.png"
      },
      {
        "name": "Shrubby tororaro",
        "scientific_name": "Muehlenbeckia astonii",
        "description": "A dense, wiry shrub with small leaves and an intricate, tangled growth habit.",
        "benefits": "Drought-resistant, low maintenance, and good for erosion control.",
        "image_source": "/image/Muehlenbeckia-astonii.png"
      }
    ],
    "Hamilton": [
      {
        "name": "Broadleaf",
        "scientific_name": "Griselinia littoralis",
        "description": "A versatile evergreen shrub that can be used as hedging or standalone planting.",
        "benefits": "Tolerates a range of soil types, wind-resistant, and requires minimal pruning.",
        "image_source": "/image/Griselinia-littoralis.png"
      },
      {
        "name": "Coastal Astelia",
        "scientific_name": "Astelia banksii",
        "description": "A silver-leaved perennial that adds texture and color to plantings.",
        "benefits": "Prefers well-drained soil, drought-tolerant, and low maintenance.",
        "image_source": "/image/Astelia-banksii.png"
      },
      {
        "common_name": "Kohuhu",
        "scientific_name": "Pittosporum tenuifolium",
        "description": "A fast-growing, evergreen tree or shrub with small, wavy-edged leaves.",
        "benefits": "Tolerates coastal conditions and wind, low maintenance, and can be used for hedging or shelter.",
        "image_source": "/image/Pittosporum-tenuifolium.png"
      },
      {
        "common_name": "Pūkio",
        "scientific_name": "Carex secta",
        "description": "A large, native sedge with drooping, green foliage.",
        "benefits": "Ideal for damp areas, low maintenance, and provides excellent ground cover.",
        "image_source": "/image/Carex-secta.png"
      }
    ]
  },
  "planting_and_maintenance_tips": {
    "soil_preparation": "Ensure good soil preparation with adequate drainage to help plants establish quickly.",
    "mulching": "Use mulch to retain moisture and suppress weeds, reducing maintenance requirements.",
    "watering": "Water plants regularly during the establishment phase, then reduce watering as they mature.",
    "maintenance": "Periodic trimming and removal of dead material will keep the plantings healthy but generally, these species require minimal care."
  }
}
